% 地图中
m = 30;
n = 30;
p = 30;
start_node = [5, 28, 2];  % 起点
target_node = [27, 3, 28];  % 终点



% 自定义障碍物的位置（手动输入障碍物的坐标）
% 格式：[x1, y1, z1; x2, y2, z2; ...]
% 以下为自定义障碍物的示例位置
obs = [



10,25,10;
    10, 10, 10;  % 障碍物2

    18, 18, 20;
    20,12,20;
    20,13,16;
    25,5,25;
25,15,5;

    round(m / 2), round(n / 2), round(p / 2)  % 中心点的障碍物
];
d0=4;
r=300;
moving_obs = [10,20,12,0,0,0];     %移动障碍物初始位置


% 地图小
m = 30;
n = 30;
p = 30;
start_node = [3, 4, 5];  % 起点
target_node = [26, 27, 28];  % 终点

% 自定义障碍物的位置（手动输入障碍物的坐标）
% 格式：[x1, y1, z1; x2, y2, z2; ...]
% 以下为自定义障碍物的示例位置
obs = [
    5, 5, 5;  % 障碍物1
    9, 7.5, 9.5;
    7, 8, 9;
    8, 8, 8;
    10, 10, 10;  % 障碍物2
    15, 15, 15;  % 障碍物3
    18, 18, 20;
    20, 10, 25;   % 障碍物4
    25, 25, 25;  % 障碍物5
    round(m / 2), round(n / 2), round(p / 2)  % 中心点的障碍物
];
d0=1;
r=150;
moving_obs = [9,11,12,0,0,0];     %移动障碍物初始位置
% 地图大
m = 30;
n = 30;
p = 30;
start_node = [5, 25, 10];  % 起点
target_node = [27, 3, 17];  % 终点



% 自定义障碍物的位置（手动输入障碍物的坐标）
% 格式：[x1, y1, z1; x2, y2, z2; ...]
% 以下为自定义障碍物的示例位置
obs = [

10,20,12;

22,10,15;



    round(m / 2), round(n / 2), round(p / 2)  % 中心点的障碍物
];
d0=10;
r=1000;

moving_obs = [19,15,14,0,0,0];     %移动障碍物初始位置